app/controllers/characters_controller.rb

INSERT INTO "characters" ("name", "server", "spec", "subspec", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Oryx"], ["server", "Arugal"], ["spec", "Warrior"], ["subspec", "Fury"], ["created_at", "2020-01-14 03:17:37.195512"], ["updated_at", "2020-01-14 03:17:37.195512"], ["user_id", 25]]
---
  def create
    # character = Character.find_by name: params[:name]
    # raise 'hell'
    # Create the new character using the params passed through from
    # the form
    @character = Character.create name: params[:character][:name], server: params[:character][:server], spec: params[:character][:spec], subspec: params[:character][:subspec]