app/controllers/characters_controller.rb

  def index
    @characters = Character.where :user => @current_user
---
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = $1  [["user_id", 18]]

  def show
    @character = Character.find params[:id]
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]

  def create

    character = Character.new character_params

    # @character = Character.create name: params[:character][:name], server: params[:character][:server], spec: params[:character][:spec], subspec: params[:character][:subspec], image: params[:character][:image], user: @current_user


    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      character.image = req["public_id"]
    end

    character.user_id = @current_user.id

    character.save
---
INSERT INTO "characters" ("name", "server", "spec", "subspec", "image", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @character = Character.find params[:id]
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 166], ["LIMIT", 1]]

  def update
    character = Character.find params[:id]
    character.update character_params
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 166], ["LIMIT", 1]]
UPDATE "characters" SET "server" = $1, "spec" = $2, "subspec" = $3, "updated_at" = $4 WHERE "characters"."id" = $5  [["server", "Arugal"], ["spec", "Warlock"], ["subspec", "SM-Ruin"], ["updated_at", "2020-01-16 01:51:13.635625"], ["id", 163]]