app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."created_at" BETWEEN $1 AND $2  [["created_at", "2020-01-13 00:54:13.416683"], ["created_at", "2020-01-14 00:54:13.489112"]]
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Oryx"], ["body", "asdf"], ["created_at", "2020-01-14 00:57:00.039902"], ["updated_at", "2020-01-14 00:57:00.039902"]]
---
  def create
      @post = Post.new(post_params)

      @post.save