app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create user_params  # strong params

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = $1  [["user_id", 18]]
---
  def show

    # Show pages can ONLY be seen by logged-in users
    @user = User.find params[:id]
    @characters = Character.where :user => @current_user